data/perf/campaign-f3deebfbab60/primary/memcached/tsan-lo/run1/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       154941.56          ---          ---         4.85836         4.83100        10.68700        13.37500     10574.71 
Gets      1549398.52      1244.17   1548154.36         4.74561         4.70300        10.49500        13.18300     39245.33 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1704340.08      1244.17   1548154.36         4.75586         4.70300        10.49500        13.18300     49820.04 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       143619.20          ---          ---         5.24724         5.24700        11.26300        14.84700      9801.97 
Gets      1436176.16       644.75   1435531.41         5.11922         5.11900        11.07100        14.65500     36346.74 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1579795.35       644.75   1435531.41         5.13086         5.15100        11.07100        14.65500     46148.71 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       151151.00          ---          ---         4.99620         4.95900        11.07100        14.07900     10316.01 
Gets      1511493.37      1112.03   1510381.34         4.87878         4.83100        10.87900        13.95100     38279.07 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1662644.37      1112.03   1510381.34         4.88945         4.86300        10.87900        13.95100     48595.08